Tekla Open API Reference for Tekla Structures 2025
DisposableToken.Addition Operator
 Combines the two disposable objects.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static DisposableToken operator +(
	DisposableToken a,
	IDisposable b
)
Public Shared Operator + (
	a As DisposableToken,
	b As IDisposable
) As DisposableToken
Parameters
a
Type: Tekla.Structures.Model.DisposableToken
The left hand side operand.
b
Type: System.IDisposable
The right hand side operand.
Return Value
Type: DisposableToken
The combined disposable object.
See Also
Reference
DisposableToken Class
Tekla.Structures.Model Namespace